workbench/soap_apex.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ns1="http://soap.sforce.com/2006/08/apex">
	<SOAP-ENV:Header>
		<ns1:SessionHeader>
			<ns1:sessionId>
				tKVxJi0Es_wcrdSO4rnbApWzFgGh2jb6H0ScpDWvERcIvHm9Bs5VcvlsTMFAMpEKHI0MdrXB6wnS3S.01q2yAjgDS9N4udZpue_z1DRFgZHk8d2OcrfXEQLC7uKv2oNrWZchZACU
			</ns1:sessionId>
		</ns1:SessionHeader>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<ns1:compileAndTest>
			<ns1:checkOnly>false</ns1:checkOnly>
			<ns1:classes>
				public class c1{ public static String s ='HELLO'; public
				static testmethod void test1(){
				System.assert(s=='HELLO'); }}
			</ns1:classes>
			<ns1:classes>
				public class TestT1{ public static testmethod void
				test1(){ Account a = new Account(name='TEST');
				insert(a); a = [select id,description from Account where
				id=:a.id];
				System.assert(a.description.contains('t1_UPDATE')); }}
			</ns1:classes>
			<ns1:deleteClasses />
			<ns1:deleteTriggers />
			<ns1:runTestsRequest />
			<ns1:triggers>
				trigger t1 on Account (before insert){ for(Account
				a:Trigger.new){ a.description = 't1_UPDATE';}}
			</ns1:triggers>
		</ns1:compileAndTest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
